# Practice SQL

Okay, our `SQL` feet are wet. 
We have seen how to load databases and how to query databases so let's step a little further into the `SQL` pool and query a larger database. 
In the previous notebooks, we were using a `SQLite` engine but `SQLite` is...well...lite. Instead, in this practice we are going to work with a `PostgreSQL` database, which is one of the most advanced open source `SQL` databases available. 
Before we begin, let's talk about the data.


### Twitter Data

We'll be working with "some" Twitter data in this practice. 
"Some" is in quotes only because we are working with over 250 million rows (250 with 6 ZEROS) and that is only "some" of what is being collected. 
This database has been collecting from 50 different US cities since from Jan 2017 until mid May 2017 for this particular copy of the database. 

--- 

Given the volume of data, this database server is a good introduction to some other database concepts we have yet to touch on. 
Again, `pandas` has some pretty neat tools for interacting with databases of all flavors. All we have to do is establish the connection and we can start making requests of the database.

In [1]:
import psycopg2
import pandas as pd

try:
    connect_str = "dbname='twitter' user='dsa_ro_user' host='pgsql.dsa.lan' password='readonly'"
    # use our connection values to establish a connection
    conn = psycopg2.connect(connect_str)
except:
    print("Something went wrong...probably the wrong permissions")

`psycopg2` is a package that allows `Python` to connect to a `Postgres` database.

We didn't state this explicitly, but databases allow us to query other aspects of it other than tables. 
We can do something like write a query to get the table names in the database. 
Let's do that now so we can get an idea of what types of tables we will be working with.

In [2]:
statement = """SELECT table_name 
    FROM information_schema.tables
    WHERE table_schema = 'twitter'"""

pd.read_sql_query(statement,conn)

     table_name
0       mention
1      new_slur
2  pred_output2
3  pred_output1
4         tweet
5           url
6           job
7       hashtag

So we are working with a `tweet`, `hashtag`, `mention`, `url`, and `job` table, but that doesn't tell us a whole lot about the contents of any given table. 
At most, we can infer from the table names what type of data might be in them. 
But it would be better to know the attributes and perhaps what kind of data type they are. 

Again, we will be referencing the database's `information_schema` in order to pull this information out. 
Study the following query and compare it with the last.

In [3]:
statement = """                              
SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'hashtag';
"""

pd.read_sql_query(statement,conn)

      column_name          data_type is_nullable
0      hashtag_id             bigint          NO
1        tweet_id  character varying          NO
2            text  character varying          NO
3     index_start           smallint          NO
4       index_end           smallint          NO
5          job_id            integer          NO
6  analysis_state            integer         YES

Now we know a bit about the contents of the of the `hashtag` table, which is good because we will be using it quite a bit in this practice. 

**Take a moment and contemplate the `CREATE TABLE` command that was used to create this table.**

Moving on, we can explore what type of attributes are in the `tweet` data?

**Activity 1:** Write a query to look at the `column_name`s, `data_type`s and `character_maximum_length`s of the `tweet` table.

In [4]:
# Code for Activity 1 according to practice sheet
# ----------------------------
statement = """                              
SELECT column_name, data_type, character_maximum_length
FROM information_schema.columns
WHERE table_name = 'tweet';
"""

pd.read_sql_query(statement,conn)

,column_name,data_type,character_maximum_length
0,tweet_id_str,character varying,20.0
1,job_id,integer,NaN
2,created_at,timestamp without time zone,NaN
3,text,text,NaN
4,from_user,character varying,45.0
5,from_user_id_str,character varying,20.0
6,from_user_name,character varying,45.0
7,from_user_fullname,text,NaN
8,from_user_created_at,timestamp without time zone,NaN
9,from_user_followers,integer,NaN
10,from_user_following,integer,NaN
11,from_user_favorites,integer,NaN
12,from_user_tweets,integer,NaN
13,from_user_timezone,character varying,45.0
14,to_user,character varying,45.0
15,to_user_id_str,character varying,20.0
16,to_user_name,character varying,45.0
17,source,text,NaN
18,location_geo,text,NaN
19,location_geo_0,numeric,NaN
20,location_geo_1,numeric,NaN
21,iso_language,character varying,3.0
22,analysis_state,integer,NaN

**Activity 1.2** Now lets write a querry that would get **all** of the column characteristics (ie. `column_name`, `data_type`, etc.) for a single table, lets say the 'tweet' table.

In [5]:
# Your code for Activity 1 goes here
# --------------

statement = """                              
SELECT *
FROM information_schema.columns
WHERE table_name = 'tweet';
"""

pd.read_sql_query(statement,conn)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,twitter,twitter,tweet,tweet_id_str,1,None,NO,character varying,20.0,8.000000e+01,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,twitter,twitter,tweet,job_id,2,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,twitter,twitter,tweet,created_at,3,None,NO,timestamp without time zone,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,twitter,twitter,tweet,text,4,None,NO,text,NaN,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,twitter,twitter,tweet,from_user,5,None,NO,character varying,45.0,1.800000e+02,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,twitter,twitter,tweet,from_user_id_str,6,None,NO,character varying,20.0,8.000000e+01,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,twitter,twitter,tweet,from_user_name,7,None,NO,character varying,45.0,1.800000e+02,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,twitter,twitter,tweet,from_user_fullname,8,None,NO,text,NaN,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,twitter,twitter,tweet,from_user_created_at,9,None,NO,timestamp without time zone,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
9,twitter,twitter,tweet,from_user_followers,10,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
10,twitter,twitter,tweet,from_user_following,11,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
11,twitter,twitter,tweet,from_user_favorites,12,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
12,twitter,twitter,tweet,from_user_tweets,13,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
13,twitter,twitter,tweet,from_user_timezone,14,NULL::character varying,YES,character varying,45.0,1.800000e+02,...,NO,None,None,None,None,None,NO,NEVER,None,YES
14,twitter,twitter,tweet,to_user,15,NULL::character varying,YES,character varying,45.0,1.800000e+02,...,NO,None,None,None,None,None,NO,NEVER,None,YES
15,twitter,twitter,tweet,to_user_id_str,16,NULL::character varying,YES,character varying,20.0,8.000000e+01,...,NO,None,None,None,None,None,NO,NEVER,None,YES
16,twitter,twitter,tweet,to_user_name,17,NULL::character varying,YES,character varying,45.0,1.800000e+02,...,NO,None,None,None,None,None,NO,NEVER,None,YES
17,twitter,twitter,tweet,source,18,NULL::character varying,YES,text,NaN,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
18,twitter,twitter,tweet,location_geo,19,None,YES,text,NaN,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
19,twitter,twitter,tweet,location_geo_0,20,NULL::numeric,YES,numeric,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
20,twitter,twitter,tweet,location_geo_1,21,NULL::numeric,YES,numeric,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
21,twitter,twitter,tweet,iso_language,22,None,NO,character varying,3.0,1.200000e+01,...,NO,None,None,None,None,None,NO,NEVER,None,YES
22,twitter,twitter,tweet,analysis_state,23,0,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES

**Activity 2:** How might you get **all** of the column characteristics (ie. `column_name`, `data_type`, etc.) for a single table?

In [6]:
# Your code for Activity 2 goes here
# --------------

# This is the same as above but I changed the Table name.

statement = """                              
SELECT *
FROM information_schema.columns
WHERE table_name = 'url';
"""

pd.read_sql_query(statement,conn)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,twitter,twitter,url,url_id,1,nextval('twitter.url_url_id_seq'::regclass),NO,bigint,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,twitter,twitter,url,tweet_id,2,None,NO,character varying,20.0,80.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,twitter,twitter,url,url,3,None,NO,character varying,255.0,1020.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,twitter,twitter,url,expanded_url,4,None,NO,character varying,400.0,1600.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,twitter,twitter,url,display_url,5,None,NO,character varying,255.0,1020.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,twitter,twitter,url,index_start,6,None,NO,smallint,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,twitter,twitter,url,index_end,7,None,NO,smallint,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,twitter,twitter,url,job_id,8,None,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,twitter,twitter,url,analysis_state,9,0,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES

That's enough surface level exploring for now. 
Let's get our hands dirty a bit. 
To do that, we have to dig ;) into the data. 

Oh! but before we dig in we need to cover the idea of `LIMIT`. 
There are several reasons to put a `limit` on the number of rows returned in a query. 
For example, if we just want to get an idea of what our data looks like, we might specify a `LIMIT` of `5`. 
This is similar to running `head(dataframe_name)` in `R` or `dataframe_name.head()` in `Python`. 
But the reason we are using it is more for performance reasons. 
Remember, this is a fairly large database, and not specifying a limit and trying to pull millions of rows of data into Pandas could slow the operation down to a pace that is beyond the limit of your patience. 

So let's introduce `LIMIT` right now.

```SQL
SELECT <column_names>
FROM <table_name>
LIMIT <numeber_of_rows>
```

In [7]:
statement = """
SELECT * 
FROM twitter.hashtag
LIMIT 1000
"""

pd.read_sql_query(statement,conn)

,hashtag_id,tweet_id,text,index_start,index_end,job_id,analysis_state
0,10000679,830193796826689536,Pain,38,43,273,0
1,10000680,830193795866062848,hiring,6,13,273,0
2,10000681,830193795866062848,Beauty,72,79,273,0
3,10000682,830193795866062848,Chicago,80,88,273,0
4,10000683,830193795866062848,Job,93,97,273,0
...,...,...,...,...,...,...,...
995,10001674,830189526781919232,BlackGaySlay,19,32,290,0
996,10001675,830188121128005633,GetAFilmsAttention,51,70,294,0
997,10001676,830188110625505281,50ShadesOfGrayson,41,59,294,0
998,10001677,830188110625505281,YoungJustice,119,132,294,0
999,10001678,830189478295830529,INFOWARWARRIOR,55,70,290,0

#### Nested Queries

So **LIMIT**s employed for performance sake make for the appropriate time to cover nested queries. 
Nested queries are a good way to extract further information after performing some operation. 
Take the example below. 
We are trying to return a table that displays the unique hashtags in one column and how many times they occur in another. 
But remember, this database is large and we don't want to perform this over the entire table, 
so instead, we are going to perform this query over another query nested inside of it where we limit the number of rows to 1000.

We can break this query apart from the inner part first to the outer part.

```SQL
SELECT text
FROM twitter.hashtag
LIMIT 1000
```

We know what this query is going to return. 
It's going to return a table of only the `text` column form the `hashtag` table, 
but only the first 1000 rows. 
We will nest this table inside of another query so that it is only performing an aggregation off of a subset (1000 rows) of the data:

```SQL
SELECT DISTINCT text, COUNT(*)
FROM( ...
...) AS t1
GROUP BY text
```

In this outer statement, we are wanting to know the unique terms as well as their counts for that 1000 rows we pull. 
The `AS t1` just names the nested query. 
Now we can take a look at what this actually returns.

In [8]:
statement = """
SELECT DISTINCT text, COUNT(*)
FROM(
    SELECT text
    FROM twitter.hashtag
    LIMIT 1000) AS t1
GROUP BY text
"""

pd.read_sql_query(statement,conn)

            text  count
0           SAFe      1
1     SeatlleSEO      1
2     photoshoot      1
3        bologna      1
4     freakyfast      1
..           ...    ...
713    MultiTask      1
714   milfhookup      1
715    AustinSEO      1
716  dmntakeover      5
717          lit      1

[718 rows x 2 columns]

Take a look at the column names of the returned data frame: `text` and `count`.  
Right now there is no order and that can get a little annoying...


**Activity 3:** Order the query above by `count`.

In [9]:
# Your code for Activity 3 goes here
# --------------

statement = """
SELECT DISTINCT text, COUNT(*)
FROM(
    SELECT text
    FROM twitter.hashtag
    LIMIT 1000) AS t1
GROUP BY text
ORDER BY count
"""

pd.read_sql_query(statement,conn)

                  text  count
0              2KTVWOW      1
1                  3EG      1
2                 3Mer      1
3    50ShadesOfGrayson      1
4           AACCIPRESS      1
..                 ...    ...
713             Hiring      8
714             hiring     10
715       BlackGaySlay     11
716                job     11
717              Olitz     11

[718 rows x 2 columns]

And of course we want to know the most popular hashtags by `count`.

**Activity 4:** Order the same query above from greatest to fewest count.

In [10]:
# Your code for Activity 4 goes here
# ----------------

# Your code for Activity 3 goes here
# --------------

statement = """
SELECT DISTINCT text, COUNT(*)
FROM(
    SELECT text
    FROM twitter.hashtag
    LIMIT 1000) AS t1
GROUP BY text
ORDER BY count DESC
"""

pd.read_sql_query(statement,conn)

             text  count
0    BlackGaySlay     11
1             job     11
2           Olitz     11
3          hiring     10
4       CareerArc      8
..            ...    ...
713         young      1
714  YoungJustice      1
715       yourlib      1
716   YouTubestar      1
717     ZeroTrust      1

[718 rows x 2 columns]

Many databases also give the user the ability to perform operations on the columns within the query. 
These operations are very helpful in removing data carpentry steps from later on in our analysis. 

You may have noticed that some hashtags are actually repeated twice (or thrice or more) despite using `DISTINCT` on the `text` column. 
Can you identify why this is? 
Well, it is because `DISTINCT` is case sensitive and some hashtags are capitalized while others aren't. 
Fortunately, there is an operation that we can perform on the `text` column to transform these values all to one case on the fly.

Take a look at the `LOWER()` operation...

In [11]:
statement = """
SELECT LOWER(text) 
FROM twitter.hashtag
LIMIT 1000
"""

pd.read_sql_query(statement,conn)

                  lower
0                  pain
1                hiring
2                beauty
3               chicago
4                   job
..                  ...
995        blackgayslay
996  getafilmsattention
997   50shadesofgrayson
998        youngjustice
999      infowarwarrior

[1000 rows x 1 columns]

**Activity 5:** Now, similar to the queries above, count the number of distinct hashtag `text`s but this time transform `text` to lower. Remember to put a `LIMIT` of 1000 in the nested query. Be sure to put the count in descending order.

*HINT*: `LOWER()` should go in the nested portion.

In [12]:
# Your code for Activity 5 goes here
# --------------

# Remeber we need to add the AS statement

statement = """
SELECT DISTINCT text, COUNT(*)
FROM(
    SELECT LOWER(text) AS text
    FROM twitter.hashtag
    LIMIT 1000) AS t1
GROUP BY text
ORDER BY count DESC
"""

pd.read_sql_query(statement, conn)

             text  count
0          hiring     18
1             job     18
2    blackgayslay     14
3             win     13
4        giveaway     11
..            ...    ...
681         young      1
682  youngjustice      1
683       yourlib      1
684   youtubestar      1
685     zerotrust      1

[686 rows x 2 columns]

And there is so much more than just the `COUNT` of rows. 
You can also find the `AVERAGE` (arithmetic mean) of a numeric column. 
Keep in mind that the query below is `GROUP`ed `BY` `text`.

In [13]:
statement = """
SELECT DISTINCT text, AVG(index_start)
FROM(
    SELECT lower(text) AS text, index_start
    FROM twitter.hashtag
    LIMIT 1000) AS t1
GROUP BY text
ORDER BY avg DESC
"""

pd.read_sql_query(statement,conn)

               text    avg
0           grammys  137.0
1                p2  135.0
2           cookies  134.0
3           coverup  132.0
4         kaneclone  132.0
..              ...    ...
681  wendyowilliams    0.0
682            whoa    0.0
683     wildturkeys    0.0
684         workout    0.0
685        xclusive    0.0

[686 rows x 2 columns]

We're going to return to the world of `Joins` now. 
There is one thing we should add about `JOIN`s that we didn't have the opportunity to discuss in the lab. 
It is possible to perform a full outer join without using the `JOIN` statement. 
All you have to do is specify is what columns to match from the two (or more) tables in the `WHERE` clause. 

Take the example below. 
We are wanting to return all rows from both tables where the tweet_id matches in both the `hashtag` and `tweet` tables. 
Keep in mind, the `tweet` table has the column named `tweet_id_str`.

In [14]:
statement = """
SELECT t.tweet_id_str, t.text, h.text
FROM twitter.tweet t, twitter.hashtag h
WHERE t.tweet_id_str = h.tweet_id
LIMIT 100;
"""

pd.read_sql_query(statement,conn)

,tweet_id_str,text,text
0,830193796826689536,RT @ehlJAMA: Management of Persistent #Pain in...,Pain
1,830193795866062848,We're #hiring! Click to apply: Beauty Advisor ...,hiring
2,830193795866062848,We're #hiring! Click to apply: Beauty Advisor ...,Beauty
3,830193795866062848,We're #hiring! Click to apply: Beauty Advisor ...,Chicago
4,830193795866062848,We're #hiring! Click to apply: Beauty Advisor ...,Job
...,...,...,...
95,830193757580570630,Me during college..#FEHeroes https://t.co/JQ72...,FEHeroes
96,830193756179607553,RT @charliekirk11: Never Underestimate The Pow...,BigGovSucks
97,830193102845534210,RT @LHSSADD1: Nice showcase! #SADD #February h...,SADD
98,830193102845534210,RT @LHSSADD1: Nice showcase! #SADD #February h...,February
99,830193755978338305,RT @HayMyNameIsMika: Love the hashtag,blackgayslay

# Save your notebook, then `File > Close and Halt`